# Lockable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Panel..::..Lockable Property
Panel Class See Also
---
This property is used to know whether a panel can be locked.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Lockable { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Lockable As Boolean
	Get
```

Visual C++
---
```text
public:
property bool Lockable {
	bool get ();
}
```

# Remarks
If the panel can be locked, return true, else false.
# See Also
Panel Class
Autodesk.Revit.DB Namespace